STL_Cases/STL_IGU_55/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

14
(
    inlet1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4;
        startFace       342359;
    }
    inlet2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4;
        startFace       342363;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16;
        startFace       342367;
    }
    windowsmall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          126;
        startFace       342383;
    }
    door
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          112;
        startFace       342509;
    }
    columns
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          31297;
        startFace       342621;
    }
    windowbig
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2160;
        startFace       373918;
    }
    ceiling
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1444;
        startFace       376078;
    }
    floor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1296;
        startFace       377522;
    }
    wallwindow
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1539;
        startFace       378818;
    }
    walldoor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1506;
        startFace       380357;
    }
    walloutside
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2229;
        startFace       381863;
    }
    wallinside
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2229;
        startFace       384092;
    }
    emission_surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          196;
        startFace       386321;
    }
)

// ************************************************************************* //
